
//2022.03.08

// # 과제 - 객체 모델링
//		1) 현실세계의 객체 중, 모델링 대상 - 자전거 
//		클래스 이름부터 차이 : 모델링 대상 객체가 무엇인지 확인이 되어야 한다!
//		2) 자전거 => <객체 모델링> => 클래스로 선언(필드, 생성자)
//		어느정도까지 속성과 행위를 추출할것인가?
//		행위도 추출하기!! 범위 : 속성과 행위까지 모두 대상
//		3) 부품(집합관계)을 어느레벨까지 추출할거냐 (식별)
//		-> 이건 각 조에 맡김

//		속성 : 적어도 몸체(프레임)가 있어야한다
//		부품 : 핸들, 페달 // -> 집합관계
//		행위 : 전진, 후진, 브레이크, 기어변경 



////클래스명 바이시클
//속성 : 제작회사, 모델, 색, 최고속도
//부품 : 프레임, 휠, 타이어, 레버, 안장, 페달, 기어


public class Example8 {
	
	public static void main(String[] args) {
		
		
	Bicycle	bicycle;
	BicycleExample example;
		
	} // 과제 
	
	
		
	
	
	
	

} // end class
