package coding_test_Algorism;

public class Baekjoon_2810_컵홀더 {
	
	public static void main(String[] args) {
		
		// ==============================================================
		// 문제 :
		// 극장의 한 줄에는 자리가 N개가 있다. 
		// 서로 인접한 좌석 사이에는 컵홀더가 하나씩 있고, 
		// 양 끝 좌석에는 컵홀더가 하나씩 더 있다. 
		// 또, 이 극장에는 커플석이 있다. 커플석 사이에는 컵홀더가 없다.
		//  이때, 이 줄에 사람들이 모두 앉았을 때, 컵홀더에 컵을 꽂을 수 있는 최대 사람의 수를 구하는 프로그램을 작성하시오. 
		// 모든 사람은 컵을 한 개만 들고 있고, 자신의 좌석의 양 옆에 있는 컵홀더에만 컵을 꽂을 수 있다.
		// S는 일반 좌석, L은 커플석을 의미하며, L은 항상 두개씩 쌍으로 주어진다.
		// ==============================================================
		
	} // main

} // end class
